In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('cars.csv')

In [3]:
df.sample(5)

        brand  km_driven    fuel         owner  selling_price
6397     Ford      44077  Petrol   First Owner         570000
4674  Hyundai      78000  Diesel   First Owner         409999
7458   Datsun      35000  Petrol   First Owner         240000
5972  Renault      67000  Diesel  Second Owner         265000
7223    Honda      60000  Petrol   Third Owner         229999

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   brand          8128 non-null   object
 1   km_driven      8128 non-null   int64
 2   fuel           8128 non-null   object
 3   owner          8128 non-null   object
 4   selling_price  8128 non-null   int64
dtypes: int64(2), object(3)
memory usage: 317.6+ KB

In [6]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [7]:
df['brand'].nunique()

32

In [8]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [9]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

# 1. OneHotEncoding using pandas

In [10]:
pd.get_dummies(df,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,False,True,False,False,True,False,False,False,False
1,Skoda,120000,370000,False,True,False,False,False,False,True,False,False
2,Honda,140000,158000,False,False,False,True,False,False,False,False,True
3,Hyundai,127000,225000,False,True,False,False,True,False,False,False,False
4,Maruti,120000,130000,False,False,False,True,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,False,True,True,False,False,False,False
8124,Hyundai,119000,135000,False,True,False,False,False,True,False,False,False
8125,Maruti,120000,382000,False,True,False,False,True,False,False,False,False
8126,Tata,25000,290000,False,True,False,False,True,False,False,False,False
8127,Tata,25000,290000,False,True,False,False,True,False,False,False,False

In [11]:
# In above case, the problem of multicollinearity will occur.
# So to avoid it we write the foloowing code

# 2.k-1 OneHotEncoding

In [13]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,True,False,False,False,False,False,False
1,Skoda,120000,370000,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,False
4,Maruti,120000,130000,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,True,False,False,False,False
8124,Hyundai,119000,135000,True,False,False,True,False,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,False

# 3. OneHotEncoding using Sklearn

In [14]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2)

In [15]:
X_train.head()

           brand  km_driven    fuel         owner
3927      Maruti      68700  Petrol   Third Owner
6264    Mahindra      12584  Diesel   First Owner
3673        Tata      30000  Diesel   First Owner
1003     Hyundai     110000  Diesel  Second Owner
5728  Volkswagen      27000  Diesel   First Owner

In [16]:
from sklearn.preprocessing import OneHotEncoder

In [28]:
ohe=OneHotEncoder(drop='first')

#we can also write sparse=False..if we do this then there is no need to convert it to array..it is  a numpy array only...and we can also change data type by using dtype=np.int32

In [29]:
X_train_new=ohe.fit_transform(X_train[['fuel','owner']]).toarray()

In [30]:
X_test_new=ohe.transform(X_test[['fuel','owner']]).toarray()

In [31]:
X_train[['brand','km_driven']].values

array([['Maruti', 68700],
       ['Mahindra', 12584],
       ['Tata', 30000],
       ...,
       ['Toyota', 65000],
       ['Hyundai', 80000],
       ['Maruti', 78000]], dtype=object)

In [32]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new))

array([['Maruti', 68700, 0.0, ..., 0.0, 0.0, 1.0],
       ['Mahindra', 12584, 1.0, ..., 0.0, 0.0, 0.0],
       ['Tata', 30000, 1.0, ..., 0.0, 0.0, 0.0],
       ...,
       ['Toyota', 65000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Hyundai', 80000, 0.0, ..., 1.0, 0.0, 0.0],
       ['Maruti', 78000, 1.0, ..., 0.0, 0.0, 0.0]], dtype=object)

In [33]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new)).shape

(6502, 9)

# 4. OneHotEncoding with Top Categories

In [34]:
df['brand'].unique()

array(['Maruti', 'Skoda', 'Honda', 'Hyundai', 'Toyota', 'Ford', 'Renault',
       'Mahindra', 'Tata', 'Chevrolet', 'Fiat', 'Datsun', 'Jeep',
       'Mercedes-Benz', 'Mitsubishi', 'Audi', 'Volkswagen', 'BMW',
       'Nissan', 'Lexus', 'Jaguar', 'Land', 'MG', 'Volvo', 'Daewoo',
       'Kia', 'Force', 'Ambassador', 'Ashok', 'Isuzu', 'Opel', 'Peugeot'],
      dtype=object)

In [35]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [36]:
counts=df['brand'].value_counts()

In [37]:
threshold=100

In [39]:
repl=counts[counts <=threshold].index

In [41]:
pd.get_dummies(df['brand'].replace(repl,'other')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,other
952,False,False,False,False,False,False,True,False,False,False,False,False,False
22,False,False,False,False,False,False,True,False,False,False,False,False,False
3933,False,False,False,False,False,False,False,False,False,False,False,True,False
2951,False,False,False,False,False,False,True,False,False,False,False,False,False
2028,False,False,False,False,True,False,False,False,False,False,False,False,False